Tekla.Structures.Drawing.UI.IUIEvents
Interface for the Events class allows the user to register event listeners for DrawingUI events.
This interface allows the Marshaling of the Events class with Trimble.Remoting

Tekla.Structures.Drawing.UI.IUIEvents.SelectionChange
The SelectionChange event is raised when the selection is changed in a Tekla Structures drawing.

Tekla.Structures.Drawing.UI.IUIEvents.DrawingEditorOpened
The DrawingEditorOpened event is raised when the drawing editor is opened.

Tekla.Structures.Drawing.UI.IUIEvents.DrawingEditorClosed
The DrawingEditorClosed event is raised when the drawing editor is closed.

Tekla.Structures.Drawing.UI.IUIEvents.DrawingLoaded
The DrawingLoaded event is raised when a new drawing is opened in the drawing editor.

Tekla.Structures.Drawing.UI.IUIEvents.DrawingListSelectionChanged
The DrawingListSelectionChanged event is raised when selection on the drawing list has changed.
Remarks:
This event is also raised if a file is selected or deselected in Document Manager,
but no information about the selected file(s) is available.

Tekla.Structures.Drawing.UI.IUIEvents.DocumentManagerClosed
The DocumentManagerClosed eventis raised when the document manager is closed.

Tekla.Structures.Drawing.UI.IUIEvents.Interrupted
Occurs when user interrupts.

Tekla.Structures.Drawing.UI.IUIEvents.OnSelectionChange(System.String,System.Object[])


Tekla.Structures.Drawing.UI.IUIEvents.OnDrawingEditorOpen(System.String,System.Object[])


Tekla.Structures.Drawing.UI.IUIEvents.OnDrawingEditorClose(System.String,System.Object[])


Tekla.Structures.Drawing.UI.IUIEvents.OnDrawingLoaded(System.String,System.Object[])


Tekla.Structures.Drawing.UI.IUIEvents.OnDrawingListSelectionChanged(System.String,System.Object[])


Tekla.Structures.Drawing.UI.IUIEvents.OnDocumentManagerClosed(System.String,System.Object[])


Tekla.Structures.Drawing.UI.IUIEvents.OnInterrupted
Called when uesr interrupts.

Tekla.Structures.Drawing.UI.IUIEvents.Register
Registers the instance to listen to the specified events.
Throws System.InvalidOperationException: Thrown if attempting registration when already registered.

Tekla.Structures.Drawing.UI.IUIEvents.UnRegister
Unregisters the instance from listening to events.